           05  FAKRAND-SEED-NO     PIC S9(9)  COMP VALUE 0.

           05  FAKRAND-SEED-TEXT   PIC X(80)       VALUE SPACES.
           
           05  FAKRAND-RANDOM-NO   PIC SV9(9) COMP.
